vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7037.inc
PLLSTA_OFFSET                  EQU       0x0400
POWKEY0_OFFSET                 EQU       0x0404
POWCON_OFFSET                  EQU       0x0408
POWKEY1_OFFSET                 EQU       0x040C
PLLKEY0_OFFSET                 EQU       0x0410
PLLCON_OFFSET                  EQU       0x0414
PLLKEY1_OFFSET                 EQU       0x0418
OSC0CON_OFFSET                 EQU       0x0440
#if           ALLOW_DEPRECATED_NAMES        
; "OSCCON_OFFSET" has been deprecated. Use "OSC0CON_OFFSET" instead.
OSCCON_OFFSET                  EQU       0xFFFF0440
#endif
OSC0STA_OFFSET                 EQU       0x0444
#if           ALLOW_DEPRECATED_NAMES        
; "OSCSTA_OFFSET" has been deprecated. Use "OSC0STA_OFFSET" instead.
OSCSTA_OFFSET                  EQU       0xFFFF0444
#endif
OSC0VAL0_OFFSET                EQU       0x0448
#if           ALLOW_DEPRECATED_NAMES        
; "OSCVAL0_OFFSET" has been deprecated. Use "OSC0VAL0_OFFSET" instead.
OSCVAL0_OFFSET                 EQU       0xFFFF0448
#endif
OSC0VAL1_OFFSET                EQU       0x044C
#if           ALLOW_DEPRECATED_NAMES        
; "OSCVAL1_OFFSET" has been deprecated. Use "OSC0VAL1_OFFSET" instead.
OSCVAL1_OFFSET                 EQU       0xFFFF044C
#endif
LOCCON_OFFSET                  EQU       0x0480
LOCUSR0_OFFSET                 EQU       0x0484
LOCUSR1_OFFSET                 EQU       0x0488
LOCMAX_OFFSET                  EQU       0x048C
LOCMIN_OFFSET                  EQU       0x0490
LOCSTA_OFFSET                  EQU       0x0494
LOCVAL0_OFFSET                 EQU       0x0498
LOCVAL1_OFFSET                 EQU       0x049C
LOCKEY_OFFSET                  EQU       0x04A0



; ADC interface registers

ADCBASE                        EQU       0xFFFF0500
ADCSTA                         EQU       0xFFFF0500
ADCMSKI                        EQU       0xFFFF0504
ADCMDE                         EQU       0xFFFF0508
ADC0CON                        EQU       0xFFFF050C
ADC1CON                        EQU       0xFFFF0510
ADCFLT                         EQU       0xFFFF0518
ADCCFG                         EQU       0xFFFF051C
ADC0DAT                        EQU       0xFFFF0520
ADC1DAT                        EQU       0xFFFF0524
ADC0OF                         EQU       0xFFFF0530
ADC1OF                         EQU       0xFFFF0534
ADC2OF                         EQU       0xFFFF0538
ADC0GN                         EQU       0xFFFF053C
ADC1GN                         EQU       0xFFFF0540
ADC2GN                         EQU       0xFFFF0544
ADC0RCL                        EQU       0xFFFF0548
ADC0RCV                        EQU       0xFFFF054C
ADC0TH                         EQU       0xFFFF0550
ADC0ACC                        EQU       0xFFFF055C
Z_ADCSTA                       EQU       ADCSTA    -Z_BASE
Z_ADCMSKI                      EQU       ADCMSKI   -Z_BASE
Z_ADCMDE                       EQU       ADCMDE    -Z_BASE
Z_ADC0CON                      EQU       ADC0CON   -Z_BASE
Z_ADC1CON                      EQU       ADC1CON   -Z_BASE
Z_ADCFLT                       EQU       ADCFLT    -Z_BASE
Z_ADCCFG                       EQU       ADCCFG    -Z_BASE
Z_ADC0DAT                      EQU       ADC0DAT   -Z_BASE
Z_ADC1DAT                      EQU       ADC1DAT   -Z_BASE
Z_ADC0OF                       EQU       ADC0OF    -Z_BASE
Z_ADC1OF                       EQU       ADC1OF    -Z_BASE
Z_ADC2OF                       EQU       ADC2OF    -Z_BASE
Z_ADC0GN                       EQU       ADC0GN    -Z_BASE
Z_ADC1GN                       EQU       ADC1GN    -Z_BASE
Z_ADC2GN                       EQU       ADC2GN    -Z_BASE
Z_ADC0RCL                      EQU       ADC0RCL   -Z_BASE
Z_ADC0RCV                      EQU       ADC0RCV   -Z_BASE
Z_ADC0TH                       EQU       ADC0TH    -Z_BASE
Z_ADC0ACC                      EQU       ADC0ACC   -Z_BASE

T_ADCSTA                       EQU       ADCSTA    -ADCBASE   
T_ADCMSKI                      EQU       ADCMSKI   -ADCBASE   
T_ADCMDE                       EQU       ADCMDE    -ADCBASE   
T_ADC0CON                      EQU       ADC0CON   -ADCBASE   
T_ADC1CON                      EQU       ADC1CON   -ADCBASE   
T_ADCFLT                       EQU       ADCFLT    -ADCBASE   
T_ADCCFG                       EQU       ADCCFG    -ADCBASE   
T_ADC0DAT                      EQU       ADC0DAT   -ADCBASE   
T_ADC1DAT                      EQU       ADC1DAT   -ADCBASE   
T_ADC0OF                       EQU       ADC0OF    -ADCBASE   
T_ADC1OF                       EQU       ADC1OF    -ADCBASE   
T_ADC2OF                       EQU       ADC2OF    -ADCBASE   
T_ADC0GN                       EQU       ADC0GN    -ADCBASE   
T_ADC1GN                       EQU       ADC1GN    -ADCBASE   
T_ADC2GN                       EQU       ADC2GN    -ADCBASE   
T_ADC0RCL                      EQU       ADC0RCL   -ADCBASE   
T_ADC0RCV                      EQU       ADC0RCV   -ADCBASE   
T_ADC0TH                       EQU       ADC0TH    -ADCBASE   
T_ADC0ACC                      EQU       ADC0ACC   -ADCBASE   

ADCSTA_OFFSET                  EQU       0x0500
ADCMSKI_OFFSET                 EQU       0x0504
ADCMDE_OFFSET                  EQU       0x0508
ADC0CON_OFFSET                 EQU       0x050C
ADC1CON_OFFSET                 EQU       0x0510
ADCFLT_OFFSET                  EQU       0x0518
ADCCFG_OFFSET                  EQU       0x051C
ADC0DAT_OFFSET                 EQU       0x0520
ADC1DAT_OFFSET                 EQU       0x0524
ADC0OF_OFFSET                  EQU       0x0530
ADC1OF_OFFSET                  EQU       0x0534
ADC2OF_OFFSET                  EQU       0x0538
ADC0GN_OFFSET                  EQU       0x053C
ADC1GN_OFFSET                  EQU       0x0540
ADC2GN_OFFSET                  EQU       0x0544
ADC0RCL_OFFSET                 EQU       0x0548
ADC0RCV_OFFSET                 EQU       0x054C
ADC0TH_OFFSET                  EQU       0x0550
ADC0ACC_OFFSET                 EQU       0x055C

; LIN Hardware SYNC Registers.

LINBASE                        EQU       0xFFFF0700
LINCON                         EQU       0xFFFF0700
LINCS                          EQU       0xFFFF0704
LINBR                          EQU       0xFFFF0708
LINBK                          EQU       0xFFFF070C
LINSTA                         EQU       0xFFFF0710
LINDAT                         EQU       0xFFFF0714
LINLOW                         EQU       0xFFFF0718
LINWU                          EQU       0xFFFF071C
Z_LINCON                       EQU       LINCON    -Z_BASE
Z_LINCS                        EQU       LINCS     -Z_BASE
Z_LINBR                        EQU       LINBR     -Z_BASE
Z_LINBK                        EQU       LINBK     -Z_BASE
Z_LINSTA                       EQU       LINSTA    -Z_BASE
Z_LINDAT                       EQU       LINDAT    -Z_BASE
Z_LINLOW                       EQU       LINLOW    -Z_BASE
Z_LINWU                        EQU       LINWU     -Z_BASE

T_LINCON                       EQU       LINCON    -LINBASE   
T_LINCS                        EQU       LINCS     -LINBASE   
T_LINBR                        EQU       LINBR     -LINBASE   
T_LINBK                        EQU       LINBK     -LINBASE   
T_LINSTA                       EQU       LINSTA    -LINBASE   
T_LINDAT                       EQU       LINDAT    -LINBASE   
T_LINLOW                       EQU       LINLOW    -LINBASE   
T_LINWU                        EQU       LINWU     -LINBASE   

