vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7037.inc
LINCON_OFFSET                  EQU       0x0700
LINCS_OFFSET                   EQU       0x0704
LINBR_OFFSET                   EQU       0x0708
LINBK_OFFSET                   EQU       0x070C
LINSTA_OFFSET                  EQU       0x0710
LINDAT_OFFSET                  EQU       0x0714
LINLOW_OFFSET                  EQU       0x0718
LINWU_OFFSET                   EQU       0x071C

; High Voltage Interface.

HVBASE                         EQU       0xFFFF0800
HVCON                          EQU       0xFFFF0804
HVDAT                          EQU       0xFFFF080C
Z_HVCON                        EQU       HVCON     -Z_BASE
Z_HVDAT                        EQU       HVDAT     -Z_BASE

T_HVCON                        EQU       HVCON     -HVBASE    
T_HVDAT                        EQU       HVDAT     -HVBASE    

HVCON_OFFSET                   EQU       0x0804
HVDAT_OFFSET                   EQU       0x080C

; GPIO + Serial Port Mux (AHB bus)

GPIOBASE                       EQU       0xFFFF0D00
GPCON                          EQU       0xFFFF0D00
GPDAT                          EQU       0xFFFF0D10
GPSET                          EQU       0xFFFF0D14
GPCLR                          EQU       0xFFFF0D18
Z_GPCON                        EQU       GPCON     -Z_BASE
Z_GPDAT                        EQU       GPDAT     -Z_BASE
Z_GPSET                        EQU       GPSET     -Z_BASE
Z_GPCLR                        EQU       GPCLR     -Z_BASE

T_GPCON                        EQU       GPCON     -GPIOBASE  
T_GPDAT                        EQU       GPDAT     -GPIOBASE  
T_GPSET                        EQU       GPSET     -GPIOBASE  
T_GPCLR                        EQU       GPCLR     -GPIOBASE  

GPCON_OFFSET                   EQU       0x0D00
GPDAT_OFFSET                   EQU       0x0D10
GPSET_OFFSET                   EQU       0x0D14
GPCLR_OFFSET                   EQU       0x0D18

; Flash Control Interface 64Kbytes (AHB bus)

FLASHBASE                      EQU       0xFFFF0E00
FEESTA                         EQU       0xFFFF0E00
FEEMOD                         EQU       0xFFFF0E04
FEECON                         EQU       0xFFFF0E08
FEEDAT                         EQU       0xFFFF0E0C
FEEADR                         EQU       0xFFFF0E10
FEESIG                         EQU       0xFFFF0E18
FEEPRO                         EQU       0xFFFF0E1C
FEEHID                         EQU       0xFFFF0E20
Z_FEESTA                       EQU       FEESTA    -Z_BASE
Z_FEEMOD                       EQU       FEEMOD    -Z_BASE
Z_FEECON                       EQU       FEECON    -Z_BASE
Z_FEEDAT                       EQU       FEEDAT    -Z_BASE
Z_FEEADR                       EQU       FEEADR    -Z_BASE
Z_FEESIG                       EQU       FEESIG    -Z_BASE
Z_FEEPRO                       EQU       FEEPRO    -Z_BASE
Z_FEEHID                       EQU       FEEHID    -Z_BASE

T_FEESTA                       EQU       FEESTA    -FLASHBASE 
T_FEEMOD                       EQU       FEEMOD    -FLASHBASE 
T_FEECON                       EQU       FEECON    -FLASHBASE 
T_FEEDAT                       EQU       FEEDAT    -FLASHBASE 
T_FEEADR                       EQU       FEEADR    -FLASHBASE 
T_FEESIG                       EQU       FEESIG    -FLASHBASE 
T_FEEPRO                       EQU       FEEPRO    -FLASHBASE 
T_FEEHID                       EQU       FEEHID    -FLASHBASE 

FEESTA_OFFSET                  EQU       0x0E00
FEEMOD_OFFSET                  EQU       0x0E04
FEECON_OFFSET                  EQU       0x0E08
FEEDAT_OFFSET                  EQU       0x0E0C
FEEADR_OFFSET                  EQU       0x0E10
FEESIG_OFFSET                  EQU       0x0E18
FEEPRO_OFFSET                  EQU       0x0E1C
FEEHID_OFFSET                  EQU       0x0E20
